# Pandas
Pandas is a library built using NumPy specifically for data analysis. You'll be using Pandas heavily for data manipulation, visualisation, building machine learning models, etc. 

There are two main data structures in Pandas - Series and Dataframes. The default way to store data is dataframes, and thus manipulating dataframes quickly is probably the most important skill set for data analysis. 

*Source: https://pandas.pydata.org/pandas-docs/stable/overview.html*

In this section, you will study:
1. The pandas Series (similar to a numpy array)
    * Creating a pandas series
    * Indexing series
2. Dataframes 
    * Creating dataframes from dictionaries
    * Importing CSV data files as pandas dataframes
    * Reading and summarising dataframes
    * Sorting dataframes

## Pandas Dataframe

In [6]:
import pandas as pd
import numpy as np

In [7]:
y=[ ]
result=1
for i in range(20,36):
    result=i*i
    y.append(result) 
x=pd.Series(y)
x.index = pd.Series(np.arange (20,36,1))

In [8]:
x

20     400
21     441
22     484
23     529
24     576
25     625
26     676
27     729
28     784
29     841
30     900
31     961
32    1024
33    1089
34    1156
35    1225
dtype: int64

In [14]:
pd.Series(np.arange(20,35)**2, index = np.arange(20,36))
# always length of the index values are equal to the length ofthe Series values

ValueError: Length of passed values is 15, index implies 16.

In [15]:
pd.Series(np.arange(20,36)**2, index = np.arange(20,36))

20     400
21     441
22     484
23     529
24     576
25     625
26     676
27     729
28     784
29     841
30     900
31     961
32    1024
33    1089
34    1156
35    1225
dtype: int32

In [19]:
df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [17]:
len(dir(pd.DataFrame))

430

In [21]:
df1 = pd.DataFrame([[1,2,3,4],[11,22,33,44]])
df1

    0   1   2   3
0   1   2   3   4
1  11  22  33  44

In [22]:
type(df1)

pandas.core.frame.DataFrame

In [23]:
df1.shape

(2, 4)

In [25]:
df1.columns = ["A","B","C","D"]
df1

    A   B   C   D
0   1   2   3   4
1  11  22  33  44

In [26]:
df1.index = ["X","Y"]
df1

    A   B   C   D
X   1   2   3   4
Y  11  22  33  44

In [27]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [28]:
df1.index

Index(['X', 'Y'], dtype='object')

In [29]:
df1.values

array([[ 1,  2,  3,  4],
       [11, 22, 33, 44]], dtype=int64)

In [38]:
# creating df using dict
di = {
    "Name" : ["Jyothi", "Shaik","Jakeera", "Divya", "Lokesh"],
    "FvColor" : ["Blue", "White", "Black", "Green", np.nan],
    "Gender" : ["F", "M","M","F", "M"]
}
df2 = pd.DataFrame(di)
df2.index = np.arange(1,6)
# print(df2)
df2

      Name FvColor Gender
1   Jyothi    Blue      F
2    Shaik   White      M
3  Jakeera   Black      M
4    Divya   Green      F
5   Lokesh     NaN      M

In [40]:
df2["Name"] # accessing one column 
type(df2["Name"])

pandas.core.series.Series

In [42]:
df2[["Name", "Gender"]] # accessing subset

      Name Gender
1   Jyothi      F
2    Shaik      M
3  Jakeera      M
4    Divya      F
5   Lokesh      M

In [47]:
df2["Name"][2]

'Shaik'

## DataFrame Indexing

In [49]:
df2[1:2]

    Name FvColor Gender
2  Shaik   White      M

In [51]:
df2[-1:] # accessing last member

     Name FvColor Gender
5  Lokesh     NaN      M

In [52]:
df2[::2]  # default 0 to n

      Name FvColor Gender
1   Jyothi    Blue      F
3  Jakeera   Black      M
5   Lokesh     NaN      M

In [53]:
df2[1::2]

    Name FvColor Gender
2  Shaik   White      M
4  Divya   Green      F

In [55]:
df2[:1]

     Name FvColor Gender
1  Jyothi    Blue      F

In [57]:
df2["Name"][-1:]

5    Lokesh
Name: Name, dtype: object

In [58]:
df2[1,4,2]

KeyError: (1, 4, 2)

In [65]:
# Fancy Slicing
df2["Name"][[4,2,1]]

4     Divya
2     Shaik
1    Jyothi
Name: Name, dtype: object

In [66]:
df2[:2] # 0,1

     Name FvColor Gender
1  Jyothi    Blue      F
2   Shaik   White      M

## iloc -- for accessing rows using integer indicies
## loc -- for accessing rows other than integer indicies

In [69]:
df2.iloc[-1]

Name       Lokesh
FvColor       NaN
Gender          M
Name: 5, dtype: object

In [68]:
df2

      Name FvColor Gender
1   Jyothi    Blue      F
2    Shaik   White      M
3  Jakeera   Black      M
4    Divya   Green      F
5   Lokesh     NaN      M

In [72]:
df2.loc[2, "Name"]

'Shaik'

In [75]:
df2.loc[[2,3], "FvColor"]

2    White
3    Black
Name: FvColor, dtype: object

In [76]:
df2.loc[[1,4,2], ["Name", "Gender"]]

     Name Gender
1  Jyothi      F
4   Divya      F
2   Shaik      M

In [77]:
df2[1:4:2] # start, end , skip

    Name FvColor Gender
2  Shaik   White      M
4  Divya   Green      F

In [80]:
df2.set_index("Name", inplace = True)

In [85]:
df2

        FvColor Gender
Name
Jyothi     Blue      F
Shaik     White      M
Jakeera   Black      M
Divya     Green      F
Lokesh      NaN      M

In [88]:
df2.loc["Jyothi"]

FvColor    Blue
Gender        F
Name: Jyothi, dtype: object

In [89]:
df2.loc["Lokesh"]

FvColor    NaN
Gender       M
Name: Lokesh, dtype: object

In [95]:
df2.reset_index(inplace = True) # for changing the original dataframe

In [96]:
df2

   level_0  index     Name FvColor Gender
0        0      0   Jyothi    Blue      F
1        1      1    Shaik   White      M
2        2      2  Jakeera   Black      M
3        3      3    Divya   Green      F
4        4      4   Lokesh     NaN      M

# Reading data

In [97]:
df = pd.read_csv("https://raw.githubusercontent.com/LavanyaPolamarasetty/Datasets/master/Classification/titanic.csv")
df

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [98]:
df.shape

(891, 11)

In [99]:
df.columns

Index(['survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked'],
      dtype='object')

In [100]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [108]:
df.head(3)# default it returns top 5 rows

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [109]:
df.tail(2)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [107]:
df.sample(3)# it returns random samples

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
595,0,3,"Van Impe, Mr. Jean Baptiste",male,36.0,1,1,345773,24.15,NaN,S
655,0,2,"Hickman, Mr. Leonard Mark",male,24.0,2,0,S.O.C. 14879,73.50,NaN,S
506,1,2,"Quick, Mrs. Frederick Charles (Jane Richards)",female,33.0,0,2,26360,26.00,NaN,S

In [114]:
df_ = pd.read_excel("2020-07-25.xlsx")
df_.head()

   Unnamed: 0 Roll Number 2020-07-25
0           0  17B81A04H1          P
1           1  198A5F0019          P
2           2  17KD1A0560          P
3           3  17KH1A0455          P
4           4  1210316262          P

In [115]:
di

{'Name': ['Jyothi', 'Shaik', 'Jakeera', 'Divya', 'Lokesh'],
 'FvColor': ['Blue', 'White', 'Black', 'Green', nan],
 'Gender': ['F', 'M', 'M', 'F', 'M']}

In [121]:
d2 = {'Name': ['Jyothi', 'Shaik', 'Jakeera'],
 'FvColor': ['Blue', 'Green', np.nan],
 }

In [122]:
df1 = pd.DataFrame(di)
df2 = pd.DataFrame(d2)
df1

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   White      M
2  Jakeera   Black      M
3    Divya   Green      F
4   Lokesh     NaN      M

In [123]:
df2

      Name FvColor
0   Jyothi    Blue
1    Shaik   Green
2  Jakeera     NaN

In [124]:
df1.append(df2)

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   White      M
2  Jakeera   Black      M
3    Divya   Green      F
4   Lokesh     NaN      M
0   Jyothi    Blue    NaN
1    Shaik   Green    NaN
2  Jakeera     NaN    NaN

In [127]:
pd.concat([df1,df2], axis = 0) # concat at rows

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   White      M
2  Jakeera   Black      M
3    Divya   Green      F
4   Lokesh     NaN      M
0   Jyothi    Blue    NaN
1    Shaik   Green    NaN
2  Jakeera     NaN    NaN

In [126]:
pd.concat([df1,df2], axis = 1)

      Name FvColor Gender     Name FvColor
0   Jyothi    Blue      F   Jyothi    Blue
1    Shaik   White      M    Shaik   Green
2  Jakeera   Black      M  Jakeera     NaN
3    Divya   Green      F      NaN     NaN
4   Lokesh     NaN      M      NaN     NaN

In [129]:
pd.merge(df2,df1) # it returns ony common data

     Name FvColor Gender
0  Jyothi    Blue      F

In [130]:
pd.merge(df1,df2, how = "left")

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   White      M
2  Jakeera   Black      M
3    Divya   Green      F
4   Lokesh     NaN      M

In [131]:
pd.merge(df1,df2, how = "right")

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   Green    NaN
2  Jakeera     NaN    NaN

In [132]:
pd.merge(df1,df2, how = "inner")

     Name FvColor Gender
0  Jyothi    Blue      F

In [133]:
pd.merge(df1,df2, how = "outer")

      Name FvColor Gender
0   Jyothi    Blue      F
1    Shaik   White      M
2  Jakeera   Black      M
3    Divya   Green      F
4   Lokesh     NaN      M
5    Shaik   Green    NaN
6  Jakeera     NaN    NaN

# Sorting
- sort by values 
- sort by index

In [154]:
df.head(2)

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
0,22.0,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,38.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C

In [156]:
df.sort_index(axis = 1).head(2)

,age,cabin,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599

In [167]:
df.sort_index(axis = 1, ascending=False)

,ticket,survived,sibsp,sex,pclass,parch,name,fare,embarked,cabin,age
0,A/5 21171,0,1,male,3,0,"Braund, Mr. Owen Harris",7.2500,S,NaN,22.0
1,PC 17599,1,1,female,1,0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",71.2833,C,C85,38.0
2,STON/O2. 3101282,1,0,female,3,0,"Heikkinen, Miss. Laina",7.9250,S,NaN,26.0
3,113803,1,1,female,1,0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",53.1000,S,C123,35.0
4,373450,0,0,male,3,0,"Allen, Mr. William Henry",8.0500,S,NaN,35.0
...,...,...,...,...,...,...,...,...,...,...,...
886,211536,0,0,male,2,0,"Montvila, Rev. Juozas",13.0000,S,NaN,27.0
887,112053,1,0,female,1,0,"Graham, Miss. Margaret Edith",30.0000,S,B42,19.0
888,W./C. 6607,0,1,female,3,2,"Johnston, Miss. Catherine Helen ""Carrie""",23.4500,S,NaN,NaN
889,111369,1,0,male,1,0,"Behr, Mr. Karl Howell",30.0000,C,C148,26.0
890,370376,0,0,male,3,0,"Dooley, Mr. Patrick",7.7500,Q,NaN,32.0

In [169]:
df.sort_index(axis = 0, ascending=False).head()

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
890,32.0,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.75,NaN,Q
889,26.0,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.00,C148,C
888,NaN,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.45,NaN,S
887,19.0,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.00,B42,S
886,27.0,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.00,NaN,S

In [171]:
df.sort_index(axis = 0, ascending=True).head()

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
0,22.0,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,38.0,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,26.0,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,35.0,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,35.0,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

In [178]:
df.sort_values("age", axis =0)

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
803,0.42,1,3,"Thomas, Master. Assad Alexander",male,0,1,2625,8.5167,NaN,C
755,0.67,1,2,"Hamalainen, Master. Viljo",male,1,1,250649,14.5000,NaN,S
644,0.75,1,3,"Baclini, Miss. Eugenie",female,2,1,2666,19.2583,NaN,C
469,0.75,1,3,"Baclini, Miss. Helene Barbara",female,2,1,2666,19.2583,NaN,C
78,0.83,1,2,"Caldwell, Master. Alden Gates",male,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
859,NaN,0,3,"Razi, Mr. Raihed",male,0,0,2629,7.2292,NaN,C
863,NaN,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,8,2,CA. 2343,69.5500,NaN,S
868,NaN,0,3,"van Melkebeke, Mr. Philemon",male,0,0,345777,9.5000,NaN,S
878,NaN,0,3,"Laleff, Mr. Kristo",male,0,0,349217,7.8958,NaN,S
888,NaN,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500,NaN,S

In [176]:
df["age"].min()

0.42

In [177]:
df["age"].max()

80.0

In [180]:
df.sort_values("name", axis =0).head()

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
845,42.0,0,3,"Abbing, Mr. Anthony",male,0,0,C.A. 5547,7.55,NaN,S
746,16.0,0,3,"Abbott, Mr. Rossmore Edward",male,1,1,C.A. 2673,20.25,NaN,S
279,35.0,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,1,1,C.A. 2673,20.25,NaN,S
308,30.0,0,2,"Abelson, Mr. Samuel",male,1,0,P/PP 3381,24.00,NaN,C
874,28.0,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,1,0,P/PP 3381,24.00,NaN,C

In [182]:
df.sort_values(["name", "age"], axis =0)

,age,survived,pclass,name,sex,sibsp,parch,ticket,fare,cabin,embarked
845,42.0,0,3,"Abbing, Mr. Anthony",male,0,0,C.A. 5547,7.5500,NaN,S
746,16.0,0,3,"Abbott, Mr. Rossmore Edward",male,1,1,C.A. 2673,20.2500,NaN,S
279,35.0,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,1,1,C.A. 2673,20.2500,NaN,S
308,30.0,0,2,"Abelson, Mr. Samuel",male,1,0,P/PP 3381,24.0000,NaN,C
874,28.0,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...
286,30.0,1,3,"de Mulder, Mr. Theodore",male,0,0,345774,9.5000,NaN,S
282,16.0,0,3,"de Pelsmaeker, Mr. Alfons",male,0,0,345778,9.5000,NaN,S
361,29.0,0,2,"del Carlo, Mr. Sebastiano",male,1,0,SC/PARIS 2167,27.7208,NaN,C
153,40.5,0,3,"van Billiard, Mr. Austin Blyler",male,0,2,A/5. 851,14.5000,NaN,S
868,NaN,0,3,"van Melkebeke, Mr. Philemon",male,0,0,345777,9.5000,NaN,S